## Write a jupyter notebook that shows the answers to these questions (try to also use markdown cells to explain what you are visualizing and the results)

### What is the dtype of a Series with mixed data types? e.g. float, int, strings

In [1]:
import pandas as pd
pd.Series(["Hi there", 2, 2.4])

0    Hi there
1           2
2         2.4
dtype: object

It is of type Object!!

### Create a DataFrame from a dict. e.g. band DataFrame from the learning notebook

In [2]:
band_dict = {
    "Jacob" : { "Age": 45, "Skill": "drums"},
    "Kimbra" : { "Age": 20, "Skill": "piano"},
    "Daniel" : { "Age": 60, "Skill": "guitar"},
    "Tori" : { "Age": 47, "Skill": "bass"},

}

In [3]:
band_df = pd.DataFrame(band_dict)
band_df

       Jacob Kimbra  Daniel  Tori
Age       45     20      60    47
Skill  drums  piano  guitar  bass

### In separate cells, get the first and last 5 elements of the new dataframe (tip: methods from Basic Functionality section)

In [4]:
# First elements - head
band_df.head(5)

       Jacob Kimbra  Daniel  Tori
Age       45     20      60    47
Skill  drums  piano  guitar  bass

In [5]:
# Last elements - tail
band_df.tail(5)

       Jacob Kimbra  Daniel  Tori
Age       45     20      60    47
Skill  drums  piano  guitar  bass

In these cases, since we do not have more than 5 rows, both head and tail give the same selection.